import random

# 直接使用，最简单
questions = [
    "自我介绍", "上一家公司测试流程？",
    "提bug流程，状态，bug级别定义", "上一家公司人员组织架构？",
    "你们组有多少开发，多少测试", "任务是怎么分配的？",
    "介绍一下你的项目", "接口测试怎么测的？",
    "web系统测试怎么测的", "app测试怎么测的？",
    "web和app的兼容性具体是怎么测的", "测试用例怎么编写的？",
    "测试用例包含哪些东西", "如何提升测试用例覆盖率，减少漏测？",
    "如何保证产品质量", "自动化目的？",
    "本地环境，测试环境，生产环境区别", "你们公司有几套测试环境，用途是什么？",
    "发现过那些经典的bug", "如何定位问题再前端还是后端？",
    "概念题解释", "同时并行两个项目怎么测试？",
    "快上线了，但是测试时间不够用怎么办", "你觉得是bug，开发不认怎么办？",
    "你对加班怎么看", "你还有什么要问我的么？",
    "你的优缺点是什么",



]
# 随机选择一个
selected_question = random.choice(questions)

print("=" * 50)
print("随机选中的问题是：")
print(selected_question)
print("=" * 50)